grevaillot/svd_tools/headers/ATSAMV71N21/pwm1.h
#pragma once 

/* --- PWM1: Pulse Width Modulation Controller ---------------------- */

/** @defgroup pwm1_registers Pulse Width Modulation Controller Register
@{*/

/** PWM1_PWM_CLK PWM Clock Register **/
#define PWM1_PWM_CLK			MMIO32(PWM1_BASE + 0x00)
/** PWM1_PWM_ENA PWM Enable Register **/
#define PWM1_PWM_ENA			MMIO32(PWM1_BASE + 0x04)
/** PWM1_PWM_DIS PWM Disable Register **/
#define PWM1_PWM_DIS			MMIO32(PWM1_BASE + 0x08)
/** PWM1_PWM_SR PWM Status Register **/
#define PWM1_PWM_SR			MMIO32(PWM1_BASE + 0x0c)
/** PWM1_PWM_IER1 PWM Interrupt Enable Register 1 **/
#define PWM1_PWM_IER1			MMIO32(PWM1_BASE + 0x10)
/** PWM1_PWM_IDR1 PWM Interrupt Disable Register 1 **/
#define PWM1_PWM_IDR1			MMIO32(PWM1_BASE + 0x14)
/** PWM1_PWM_IMR1 PWM Interrupt Mask Register 1 **/
#define PWM1_PWM_IMR1			MMIO32(PWM1_BASE + 0x18)
/** PWM1_PWM_ISR1 PWM Interrupt Status Register 1 **/
#define PWM1_PWM_ISR1			MMIO32(PWM1_BASE + 0x1c)
/** PWM1_PWM_SCM PWM Sync Channels Mode Register **/
#define PWM1_PWM_SCM			MMIO32(PWM1_BASE + 0x20)
/** PWM1_PWM_DMAR PWM DMA Register **/
#define PWM1_PWM_DMAR			MMIO32(PWM1_BASE + 0x24)
/** PWM1_PWM_SCUC PWM Sync Channels Update Control Register **/
#define PWM1_PWM_SCUC			MMIO32(PWM1_BASE + 0x28)
/** PWM1_PWM_SCUP PWM Sync Channels Update Period Register **/
#define PWM1_PWM_SCUP			MMIO32(PWM1_BASE + 0x2c)
/** PWM1_PWM_SCUPUPD PWM Sync Channels Update Period Update Register **/
#define PWM1_PWM_SCUPUPD			MMIO32(PWM1_BASE + 0x30)
/** PWM1_PWM_IER2 PWM Interrupt Enable Register 2 **/
#define PWM1_PWM_IER2			MMIO32(PWM1_BASE + 0x34)
/** PWM1_PWM_IDR2 PWM Interrupt Disable Register 2 **/
#define PWM1_PWM_IDR2			MMIO32(PWM1_BASE + 0x38)
/** PWM1_PWM_IMR2 PWM Interrupt Mask Register 2 **/
#define PWM1_PWM_IMR2			MMIO32(PWM1_BASE + 0x3c)
/** PWM1_PWM_ISR2 PWM Interrupt Status Register 2 **/
#define PWM1_PWM_ISR2			MMIO32(PWM1_BASE + 0x40)
/** PWM1_PWM_OOV PWM Output Override Value Register **/
#define PWM1_PWM_OOV			MMIO32(PWM1_BASE + 0x44)
/** PWM1_PWM_OS PWM Output Selection Register **/
#define PWM1_PWM_OS			MMIO32(PWM1_BASE + 0x48)
/** PWM1_PWM_OSS PWM Output Selection Set Register **/
#define PWM1_PWM_OSS			MMIO32(PWM1_BASE + 0x4c)
/** PWM1_PWM_OSC PWM Output Selection Clear Register **/
#define PWM1_PWM_OSC			MMIO32(PWM1_BASE + 0x50)
/** PWM1_PWM_OSSUPD PWM Output Selection Set Update Register **/
#define PWM1_PWM_OSSUPD			MMIO32(PWM1_BASE + 0x54)
/** PWM1_PWM_OSCUPD PWM Output Selection Clear Update Register **/
#define PWM1_PWM_OSCUPD			MMIO32(PWM1_BASE + 0x58)
/** PWM1_PWM_FMR PWM Fault Mode Register **/
#define PWM1_PWM_FMR			MMIO32(PWM1_BASE + 0x5c)
/** PWM1_PWM_FSR PWM Fault Status Register **/
#define PWM1_PWM_FSR			MMIO32(PWM1_BASE + 0x60)
/** PWM1_PWM_FCR PWM Fault Clear Register **/
#define PWM1_PWM_FCR			MMIO32(PWM1_BASE + 0x64)
/** PWM1_PWM_FPV1 PWM Fault Protection Value Register 1 **/
#define PWM1_PWM_FPV1			MMIO32(PWM1_BASE + 0x68)
/** PWM1_PWM_FPE PWM Fault Protection Enable Register **/
#define PWM1_PWM_FPE			MMIO32(PWM1_BASE + 0x6c)
/** PWM1_PWM_ELMR[0] PWM Event Line 0 Mode Register 0 **/
#define PWM1_PWM_ELMR[0]			MMIO32(PWM1_BASE + 0x7c)
/** PWM1_PWM_ELMR[1] PWM Event Line 0 Mode Register 0 **/
#define PWM1_PWM_ELMR[1]			MMIO32(PWM1_BASE + 0x80)
/** PWM1_PWM_SSPR PWM Spread Spectrum Register **/
#define PWM1_PWM_SSPR			MMIO32(PWM1_BASE + 0xa0)
/** PWM1_PWM_SSPUP PWM Spread Spectrum Update Register **/
#define PWM1_PWM_SSPUP			MMIO32(PWM1_BASE + 0xa4)
/** PWM1_PWM_SMMR PWM Stepper Motor Mode Register **/
#define PWM1_PWM_SMMR			MMIO32(PWM1_BASE + 0xb0)
/** PWM1_PWM_FPV2 PWM Fault Protection Value 2 Register **/
#define PWM1_PWM_FPV2			MMIO32(PWM1_BASE + 0xc0)
/** PWM1_PWM_WPCR PWM Write Protection Control Register **/
#define PWM1_PWM_WPCR			MMIO32(PWM1_BASE + 0xe4)
/** PWM1_PWM_WPSR PWM Write Protection Status Register **/
#define PWM1_PWM_WPSR			MMIO32(PWM1_BASE + 0xe8)
/** PWM1_PWM_VERSION Version Register **/
#define PWM1_PWM_VERSION			MMIO32(PWM1_BASE + 0xfc)
/** PWM1_PWM_CMUPD0 PWM Channel Mode Update Register (ch_num = 0) **/
#define PWM1_PWM_CMUPD0			MMIO32(PWM1_BASE + 0x400)
/** PWM1_PWM_CMUPD1 PWM Channel Mode Update Register (ch_num = 1) **/
#define PWM1_PWM_CMUPD1			MMIO32(PWM1_BASE + 0x420)
/** PWM1_PWM_ETRG1 PWM External Trigger Register (trg_num = 1) **/
#define PWM1_PWM_ETRG1			MMIO32(PWM1_BASE + 0x42c)
/** PWM1_PWM_LEBR1 PWM Leading-Edge Blanking Register (trg_num = 1) **/
#define PWM1_PWM_LEBR1			MMIO32(PWM1_BASE + 0x430)
/** PWM1_PWM_CMUPD2 PWM Channel Mode Update Register (ch_num = 2) **/
#define PWM1_PWM_CMUPD2			MMIO32(PWM1_BASE + 0x440)
/** PWM1_PWM_ETRG2 PWM External Trigger Register (trg_num = 2) **/
#define PWM1_PWM_ETRG2			MMIO32(PWM1_BASE + 0x44c)
/** PWM1_PWM_LEBR2 PWM Leading-Edge Blanking Register (trg_num = 2) **/
#define PWM1_PWM_LEBR2			MMIO32(PWM1_BASE + 0x450)
/** PWM1_PWM_CMUPD3 PWM Channel Mode Update Register (ch_num = 3) **/
#define PWM1_PWM_CMUPD3			MMIO32(PWM1_BASE + 0x460)

/**@}*/


/** @defgroup pwm1_pwm_clk PWMCLK PWM Clock Register
@{*/


#define PWM1_PWM_CLK_PREB_SHIFT		24
#define PWM1_PWM_CLK_PREB_MASK		0x0f
/** @defgroup pwm1_pwm_clk_preb PREB CLKB Source Clock Selection
@{*/
/**@}*/


#define PWM1_PWM_CLK_DIVB_SHIFT		16
#define PWM1_PWM_CLK_DIVB_MASK		0xff
/** @defgroup pwm1_pwm_clk_divb DIVB CLKB Divide Factor
@{*/
/**@}*/


#define PWM1_PWM_CLK_PREA_SHIFT		8
#define PWM1_PWM_CLK_PREA_MASK		0x0f
/** @defgroup pwm1_pwm_clk_prea PREA CLKA Source Clock Selection
@{*/
/**@}*/


#define PWM1_PWM_CLK_DIVA_SHIFT		0
#define PWM1_PWM_CLK_DIVA_MASK		0xff
/** @defgroup pwm1_pwm_clk_diva DIVA CLKA Divide Factor
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_ena PWMENA PWM Enable Register
@{*/

/** PWM1_PWM_ENA_CHID3 Channel ID **/
#define PWM1_PWM_ENA_CHID3		(1 << 3)
/** PWM1_PWM_ENA_CHID2 Channel ID **/
#define PWM1_PWM_ENA_CHID2		(1 << 2)
/** PWM1_PWM_ENA_CHID1 Channel ID **/
#define PWM1_PWM_ENA_CHID1		(1 << 1)
/** PWM1_PWM_ENA_CHID0 Channel ID **/
#define PWM1_PWM_ENA_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_dis PWMDIS PWM Disable Register
@{*/

/** PWM1_PWM_DIS_CHID3 Channel ID **/
#define PWM1_PWM_DIS_CHID3		(1 << 3)
/** PWM1_PWM_DIS_CHID2 Channel ID **/
#define PWM1_PWM_DIS_CHID2		(1 << 2)
/** PWM1_PWM_DIS_CHID1 Channel ID **/
#define PWM1_PWM_DIS_CHID1		(1 << 1)
/** PWM1_PWM_DIS_CHID0 Channel ID **/
#define PWM1_PWM_DIS_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_sr PWMSR PWM Status Register
@{*/

/** PWM1_PWM_SR_CHID3 Channel ID **/
#define PWM1_PWM_SR_CHID3		(1 << 3)
/** PWM1_PWM_SR_CHID2 Channel ID **/
#define PWM1_PWM_SR_CHID2		(1 << 2)
/** PWM1_PWM_SR_CHID1 Channel ID **/
#define PWM1_PWM_SR_CHID1		(1 << 1)
/** PWM1_PWM_SR_CHID0 Channel ID **/
#define PWM1_PWM_SR_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_ier1 PWMIER1 PWM Interrupt Enable Register 1
@{*/

/** PWM1_PWM_IER1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Enable **/
#define PWM1_PWM_IER1_FCHID3		(1 << 19)
/** PWM1_PWM_IER1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Enable **/
#define PWM1_PWM_IER1_FCHID2		(1 << 18)
/** PWM1_PWM_IER1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Enable **/
#define PWM1_PWM_IER1_FCHID1		(1 << 17)
/** PWM1_PWM_IER1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Enable **/
#define PWM1_PWM_IER1_FCHID0		(1 << 16)
/** PWM1_PWM_IER1_CHID3 Counter Event on Channel 3 Interrupt Enable **/
#define PWM1_PWM_IER1_CHID3		(1 << 3)
/** PWM1_PWM_IER1_CHID2 Counter Event on Channel 2 Interrupt Enable **/
#define PWM1_PWM_IER1_CHID2		(1 << 2)
/** PWM1_PWM_IER1_CHID1 Counter Event on Channel 1 Interrupt Enable **/
#define PWM1_PWM_IER1_CHID1		(1 << 1)
/** PWM1_PWM_IER1_CHID0 Counter Event on Channel 0 Interrupt Enable **/
#define PWM1_PWM_IER1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_idr1 PWMIDR1 PWM Interrupt Disable Register 1
@{*/

/** PWM1_PWM_IDR1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Disable **/
#define PWM1_PWM_IDR1_FCHID3		(1 << 19)
/** PWM1_PWM_IDR1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Disable **/
#define PWM1_PWM_IDR1_FCHID2		(1 << 18)
/** PWM1_PWM_IDR1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Disable **/
#define PWM1_PWM_IDR1_FCHID1		(1 << 17)
/** PWM1_PWM_IDR1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Disable **/
#define PWM1_PWM_IDR1_FCHID0		(1 << 16)
/** PWM1_PWM_IDR1_CHID3 Counter Event on Channel 3 Interrupt Disable **/
#define PWM1_PWM_IDR1_CHID3		(1 << 3)
/** PWM1_PWM_IDR1_CHID2 Counter Event on Channel 2 Interrupt Disable **/
#define PWM1_PWM_IDR1_CHID2		(1 << 2)
/** PWM1_PWM_IDR1_CHID1 Counter Event on Channel 1 Interrupt Disable **/
#define PWM1_PWM_IDR1_CHID1		(1 << 1)
/** PWM1_PWM_IDR1_CHID0 Counter Event on Channel 0 Interrupt Disable **/
#define PWM1_PWM_IDR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_imr1 PWMIMR1 PWM Interrupt Mask Register 1
@{*/

/** PWM1_PWM_IMR1_FCHID3 Fault Protection Trigger on Channel 3 Interrupt Mask **/
#define PWM1_PWM_IMR1_FCHID3		(1 << 19)
/** PWM1_PWM_IMR1_FCHID2 Fault Protection Trigger on Channel 2 Interrupt Mask **/
#define PWM1_PWM_IMR1_FCHID2		(1 << 18)
/** PWM1_PWM_IMR1_FCHID1 Fault Protection Trigger on Channel 1 Interrupt Mask **/
#define PWM1_PWM_IMR1_FCHID1		(1 << 17)
/** PWM1_PWM_IMR1_FCHID0 Fault Protection Trigger on Channel 0 Interrupt Mask **/
#define PWM1_PWM_IMR1_FCHID0		(1 << 16)
/** PWM1_PWM_IMR1_CHID3 Counter Event on Channel 3 Interrupt Mask **/
#define PWM1_PWM_IMR1_CHID3		(1 << 3)
/** PWM1_PWM_IMR1_CHID2 Counter Event on Channel 2 Interrupt Mask **/
#define PWM1_PWM_IMR1_CHID2		(1 << 2)
/** PWM1_PWM_IMR1_CHID1 Counter Event on Channel 1 Interrupt Mask **/
#define PWM1_PWM_IMR1_CHID1		(1 << 1)
/** PWM1_PWM_IMR1_CHID0 Counter Event on Channel 0 Interrupt Mask **/
#define PWM1_PWM_IMR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_isr1 PWMISR1 PWM Interrupt Status Register 1
@{*/

/** PWM1_PWM_ISR1_FCHID3 Fault Protection Trigger on Channel 3 **/
#define PWM1_PWM_ISR1_FCHID3		(1 << 19)
/** PWM1_PWM_ISR1_FCHID2 Fault Protection Trigger on Channel 2 **/
#define PWM1_PWM_ISR1_FCHID2		(1 << 18)
/** PWM1_PWM_ISR1_FCHID1 Fault Protection Trigger on Channel 1 **/
#define PWM1_PWM_ISR1_FCHID1		(1 << 17)
/** PWM1_PWM_ISR1_FCHID0 Fault Protection Trigger on Channel 0 **/
#define PWM1_PWM_ISR1_FCHID0		(1 << 16)
/** PWM1_PWM_ISR1_CHID3 Counter Event on Channel 3 **/
#define PWM1_PWM_ISR1_CHID3		(1 << 3)
/** PWM1_PWM_ISR1_CHID2 Counter Event on Channel 2 **/
#define PWM1_PWM_ISR1_CHID2		(1 << 2)
/** PWM1_PWM_ISR1_CHID1 Counter Event on Channel 1 **/
#define PWM1_PWM_ISR1_CHID1		(1 << 1)
/** PWM1_PWM_ISR1_CHID0 Counter Event on Channel 0 **/
#define PWM1_PWM_ISR1_CHID0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_scm PWMSCM PWM Sync Channels Mode Register
@{*/


