grevaillot/svd_tools/headers/ATSAMV71N21/pwm1.h
#define PWM1_PWM_SCM_PTRCS_SHIFT		21
#define PWM1_PWM_SCM_PTRCS_MASK		0x07
/** @defgroup pwm1_pwm_scm_ptrcs PTRCS DMA Controller Transfer Request Comparison Selection
@{*/
/**@}*/

/** PWM1_PWM_SCM_PTRM DMA Controller Transfer Request Mode **/
#define PWM1_PWM_SCM_PTRM		(1 << 20)

#define PWM1_PWM_SCM_UPDM_SHIFT		16
#define PWM1_PWM_SCM_UPDM_MASK		0x03
/** @defgroup pwm1_pwm_scm_updm UPDM Synchronous Channels Update Mode
@{*/
/**@}*/

/** PWM1_PWM_SCM_SYNC3 Synchronous Channel 3 **/
#define PWM1_PWM_SCM_SYNC3		(1 << 3)
/** PWM1_PWM_SCM_SYNC2 Synchronous Channel 2 **/
#define PWM1_PWM_SCM_SYNC2		(1 << 2)
/** PWM1_PWM_SCM_SYNC1 Synchronous Channel 1 **/
#define PWM1_PWM_SCM_SYNC1		(1 << 1)
/** PWM1_PWM_SCM_SYNC0 Synchronous Channel 0 **/
#define PWM1_PWM_SCM_SYNC0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_dmar PWMDMAR PWM DMA Register
@{*/


#define PWM1_PWM_DMAR_DMADUTY_SHIFT		0
#define PWM1_PWM_DMAR_DMADUTY_MASK		0xffffff
/** @defgroup pwm1_pwm_dmar_dmaduty DMADUTY Duty-Cycle Holding Register for DMA Access
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_scuc PWMSCUC PWM Sync Channels Update Control Register
@{*/

/** PWM1_PWM_SCUC_UPDULOCK Synchronous Channels Update Unlock **/
#define PWM1_PWM_SCUC_UPDULOCK		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_scup PWMSCUP PWM Sync Channels Update Period Register
@{*/


#define PWM1_PWM_SCUP_UPRCNT_SHIFT		4
#define PWM1_PWM_SCUP_UPRCNT_MASK		0x0f
/** @defgroup pwm1_pwm_scup_uprcnt UPRCNT Update Period Counter
@{*/
/**@}*/


#define PWM1_PWM_SCUP_UPR_SHIFT		0
#define PWM1_PWM_SCUP_UPR_MASK		0x0f
/** @defgroup pwm1_pwm_scup_upr UPR Update Period
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_scupupd PWMSCUPUPD PWM Sync Channels Update Period Update Register
@{*/


#define PWM1_PWM_SCUPUPD_UPRUPD_SHIFT		0
#define PWM1_PWM_SCUPUPD_UPRUPD_MASK		0x0f
/** @defgroup pwm1_pwm_scupupd_uprupd UPRUPD Update Period Update
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_ier2 PWMIER2 PWM Interrupt Enable Register 2
@{*/

/** PWM1_PWM_IER2_CMPU7 Comparison 7 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU7		(1 << 23)
/** PWM1_PWM_IER2_CMPU6 Comparison 6 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU6		(1 << 22)
/** PWM1_PWM_IER2_CMPU5 Comparison 5 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU5		(1 << 21)
/** PWM1_PWM_IER2_CMPU4 Comparison 4 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU4		(1 << 20)
/** PWM1_PWM_IER2_CMPU3 Comparison 3 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU3		(1 << 19)
/** PWM1_PWM_IER2_CMPU2 Comparison 2 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU2		(1 << 18)
/** PWM1_PWM_IER2_CMPU1 Comparison 1 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU1		(1 << 17)
/** PWM1_PWM_IER2_CMPU0 Comparison 0 Update Interrupt Enable **/
#define PWM1_PWM_IER2_CMPU0		(1 << 16)
/** PWM1_PWM_IER2_CMPM7 Comparison 7 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM7		(1 << 15)
/** PWM1_PWM_IER2_CMPM6 Comparison 6 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM6		(1 << 14)
/** PWM1_PWM_IER2_CMPM5 Comparison 5 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM5		(1 << 13)
/** PWM1_PWM_IER2_CMPM4 Comparison 4 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM4		(1 << 12)
/** PWM1_PWM_IER2_CMPM3 Comparison 3 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM3		(1 << 11)
/** PWM1_PWM_IER2_CMPM2 Comparison 2 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM2		(1 << 10)
/** PWM1_PWM_IER2_CMPM1 Comparison 1 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM1		(1 << 9)
/** PWM1_PWM_IER2_CMPM0 Comparison 0 Match Interrupt Enable **/
#define PWM1_PWM_IER2_CMPM0		(1 << 8)
/** PWM1_PWM_IER2_UNRE Synchronous Channels Update Underrun Error Interrupt Enable **/
#define PWM1_PWM_IER2_UNRE		(1 << 3)
/** PWM1_PWM_IER2_WRDY Write Ready for Synchronous Channels Update Interrupt Enable **/
#define PWM1_PWM_IER2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_idr2 PWMIDR2 PWM Interrupt Disable Register 2
@{*/

/** PWM1_PWM_IDR2_CMPU7 Comparison 7 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU7		(1 << 23)
/** PWM1_PWM_IDR2_CMPU6 Comparison 6 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU6		(1 << 22)
/** PWM1_PWM_IDR2_CMPU5 Comparison 5 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU5		(1 << 21)
/** PWM1_PWM_IDR2_CMPU4 Comparison 4 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU4		(1 << 20)
/** PWM1_PWM_IDR2_CMPU3 Comparison 3 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU3		(1 << 19)
/** PWM1_PWM_IDR2_CMPU2 Comparison 2 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU2		(1 << 18)
/** PWM1_PWM_IDR2_CMPU1 Comparison 1 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU1		(1 << 17)
/** PWM1_PWM_IDR2_CMPU0 Comparison 0 Update Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPU0		(1 << 16)
/** PWM1_PWM_IDR2_CMPM7 Comparison 7 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM7		(1 << 15)
/** PWM1_PWM_IDR2_CMPM6 Comparison 6 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM6		(1 << 14)
/** PWM1_PWM_IDR2_CMPM5 Comparison 5 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM5		(1 << 13)
/** PWM1_PWM_IDR2_CMPM4 Comparison 4 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM4		(1 << 12)
/** PWM1_PWM_IDR2_CMPM3 Comparison 3 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM3		(1 << 11)
/** PWM1_PWM_IDR2_CMPM2 Comparison 2 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM2		(1 << 10)
/** PWM1_PWM_IDR2_CMPM1 Comparison 1 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM1		(1 << 9)
/** PWM1_PWM_IDR2_CMPM0 Comparison 0 Match Interrupt Disable **/
#define PWM1_PWM_IDR2_CMPM0		(1 << 8)
/** PWM1_PWM_IDR2_UNRE Synchronous Channels Update Underrun Error Interrupt Disable **/
#define PWM1_PWM_IDR2_UNRE		(1 << 3)
/** PWM1_PWM_IDR2_WRDY Write Ready for Synchronous Channels Update Interrupt Disable **/
#define PWM1_PWM_IDR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_imr2 PWMIMR2 PWM Interrupt Mask Register 2
@{*/

/** PWM1_PWM_IMR2_CMPU7 Comparison 7 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU7		(1 << 23)
/** PWM1_PWM_IMR2_CMPU6 Comparison 6 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU6		(1 << 22)
/** PWM1_PWM_IMR2_CMPU5 Comparison 5 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU5		(1 << 21)
/** PWM1_PWM_IMR2_CMPU4 Comparison 4 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU4		(1 << 20)
/** PWM1_PWM_IMR2_CMPU3 Comparison 3 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU3		(1 << 19)
/** PWM1_PWM_IMR2_CMPU2 Comparison 2 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU2		(1 << 18)
/** PWM1_PWM_IMR2_CMPU1 Comparison 1 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU1		(1 << 17)
/** PWM1_PWM_IMR2_CMPU0 Comparison 0 Update Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPU0		(1 << 16)
/** PWM1_PWM_IMR2_CMPM7 Comparison 7 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM7		(1 << 15)
/** PWM1_PWM_IMR2_CMPM6 Comparison 6 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM6		(1 << 14)
/** PWM1_PWM_IMR2_CMPM5 Comparison 5 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM5		(1 << 13)
/** PWM1_PWM_IMR2_CMPM4 Comparison 4 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM4		(1 << 12)
/** PWM1_PWM_IMR2_CMPM3 Comparison 3 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM3		(1 << 11)
/** PWM1_PWM_IMR2_CMPM2 Comparison 2 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM2		(1 << 10)
/** PWM1_PWM_IMR2_CMPM1 Comparison 1 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM1		(1 << 9)
/** PWM1_PWM_IMR2_CMPM0 Comparison 0 Match Interrupt Mask **/
#define PWM1_PWM_IMR2_CMPM0		(1 << 8)
/** PWM1_PWM_IMR2_UNRE Synchronous Channels Update Underrun Error Interrupt Mask **/
#define PWM1_PWM_IMR2_UNRE		(1 << 3)
/** PWM1_PWM_IMR2_WRDY Write Ready for Synchronous Channels Update Interrupt Mask **/
#define PWM1_PWM_IMR2_WRDY		(1 << 0)

/**@}*/

