grevaillot/svd_tools/headers/ATSAMV71N21/pwm1.h
/** @defgroup pwm1_pwm_isr2 PWMISR2 PWM Interrupt Status Register 2
@{*/

/** PWM1_PWM_ISR2_CMPU7 Comparison 7 Update **/
#define PWM1_PWM_ISR2_CMPU7		(1 << 23)
/** PWM1_PWM_ISR2_CMPU6 Comparison 6 Update **/
#define PWM1_PWM_ISR2_CMPU6		(1 << 22)
/** PWM1_PWM_ISR2_CMPU5 Comparison 5 Update **/
#define PWM1_PWM_ISR2_CMPU5		(1 << 21)
/** PWM1_PWM_ISR2_CMPU4 Comparison 4 Update **/
#define PWM1_PWM_ISR2_CMPU4		(1 << 20)
/** PWM1_PWM_ISR2_CMPU3 Comparison 3 Update **/
#define PWM1_PWM_ISR2_CMPU3		(1 << 19)
/** PWM1_PWM_ISR2_CMPU2 Comparison 2 Update **/
#define PWM1_PWM_ISR2_CMPU2		(1 << 18)
/** PWM1_PWM_ISR2_CMPU1 Comparison 1 Update **/
#define PWM1_PWM_ISR2_CMPU1		(1 << 17)
/** PWM1_PWM_ISR2_CMPU0 Comparison 0 Update **/
#define PWM1_PWM_ISR2_CMPU0		(1 << 16)
/** PWM1_PWM_ISR2_CMPM7 Comparison 7 Match **/
#define PWM1_PWM_ISR2_CMPM7		(1 << 15)
/** PWM1_PWM_ISR2_CMPM6 Comparison 6 Match **/
#define PWM1_PWM_ISR2_CMPM6		(1 << 14)
/** PWM1_PWM_ISR2_CMPM5 Comparison 5 Match **/
#define PWM1_PWM_ISR2_CMPM5		(1 << 13)
/** PWM1_PWM_ISR2_CMPM4 Comparison 4 Match **/
#define PWM1_PWM_ISR2_CMPM4		(1 << 12)
/** PWM1_PWM_ISR2_CMPM3 Comparison 3 Match **/
#define PWM1_PWM_ISR2_CMPM3		(1 << 11)
/** PWM1_PWM_ISR2_CMPM2 Comparison 2 Match **/
#define PWM1_PWM_ISR2_CMPM2		(1 << 10)
/** PWM1_PWM_ISR2_CMPM1 Comparison 1 Match **/
#define PWM1_PWM_ISR2_CMPM1		(1 << 9)
/** PWM1_PWM_ISR2_CMPM0 Comparison 0 Match **/
#define PWM1_PWM_ISR2_CMPM0		(1 << 8)
/** PWM1_PWM_ISR2_UNRE Synchronous Channels Update Underrun Error **/
#define PWM1_PWM_ISR2_UNRE		(1 << 3)
/** PWM1_PWM_ISR2_WRDY Write Ready for Synchronous Channels Update **/
#define PWM1_PWM_ISR2_WRDY		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_oov PWMOOV PWM Output Override Value Register
@{*/

/** PWM1_PWM_OOV_OOVL3 Output Override Value for PWML output of the channel 3 **/
#define PWM1_PWM_OOV_OOVL3		(1 << 19)
/** PWM1_PWM_OOV_OOVL2 Output Override Value for PWML output of the channel 2 **/
#define PWM1_PWM_OOV_OOVL2		(1 << 18)
/** PWM1_PWM_OOV_OOVL1 Output Override Value for PWML output of the channel 1 **/
#define PWM1_PWM_OOV_OOVL1		(1 << 17)
/** PWM1_PWM_OOV_OOVL0 Output Override Value for PWML output of the channel 0 **/
#define PWM1_PWM_OOV_OOVL0		(1 << 16)
/** PWM1_PWM_OOV_OOVH3 Output Override Value for PWMH output of the channel 3 **/
#define PWM1_PWM_OOV_OOVH3		(1 << 3)
/** PWM1_PWM_OOV_OOVH2 Output Override Value for PWMH output of the channel 2 **/
#define PWM1_PWM_OOV_OOVH2		(1 << 2)
/** PWM1_PWM_OOV_OOVH1 Output Override Value for PWMH output of the channel 1 **/
#define PWM1_PWM_OOV_OOVH1		(1 << 1)
/** PWM1_PWM_OOV_OOVH0 Output Override Value for PWMH output of the channel 0 **/
#define PWM1_PWM_OOV_OOVH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_os PWMOS PWM Output Selection Register
@{*/

/** PWM1_PWM_OS_OSL3 Output Selection for PWML output of the channel 3 **/
#define PWM1_PWM_OS_OSL3		(1 << 19)
/** PWM1_PWM_OS_OSL2 Output Selection for PWML output of the channel 2 **/
#define PWM1_PWM_OS_OSL2		(1 << 18)
/** PWM1_PWM_OS_OSL1 Output Selection for PWML output of the channel 1 **/
#define PWM1_PWM_OS_OSL1		(1 << 17)
/** PWM1_PWM_OS_OSL0 Output Selection for PWML output of the channel 0 **/
#define PWM1_PWM_OS_OSL0		(1 << 16)
/** PWM1_PWM_OS_OSH3 Output Selection for PWMH output of the channel 3 **/
#define PWM1_PWM_OS_OSH3		(1 << 3)
/** PWM1_PWM_OS_OSH2 Output Selection for PWMH output of the channel 2 **/
#define PWM1_PWM_OS_OSH2		(1 << 2)
/** PWM1_PWM_OS_OSH1 Output Selection for PWMH output of the channel 1 **/
#define PWM1_PWM_OS_OSH1		(1 << 1)
/** PWM1_PWM_OS_OSH0 Output Selection for PWMH output of the channel 0 **/
#define PWM1_PWM_OS_OSH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_oss PWMOSS PWM Output Selection Set Register
@{*/

/** PWM1_PWM_OSS_OSSL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM1_PWM_OSS_OSSL3		(1 << 19)
/** PWM1_PWM_OSS_OSSL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM1_PWM_OSS_OSSL2		(1 << 18)
/** PWM1_PWM_OSS_OSSL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM1_PWM_OSS_OSSL1		(1 << 17)
/** PWM1_PWM_OSS_OSSL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM1_PWM_OSS_OSSL0		(1 << 16)
/** PWM1_PWM_OSS_OSSH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM1_PWM_OSS_OSSH3		(1 << 3)
/** PWM1_PWM_OSS_OSSH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM1_PWM_OSS_OSSH2		(1 << 2)
/** PWM1_PWM_OSS_OSSH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM1_PWM_OSS_OSSH1		(1 << 1)
/** PWM1_PWM_OSS_OSSH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM1_PWM_OSS_OSSH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_osc PWMOSC PWM Output Selection Clear Register
@{*/

/** PWM1_PWM_OSC_OSCL3 Output Selection Clear for PWML output of the channel 3 **/
#define PWM1_PWM_OSC_OSCL3		(1 << 19)
/** PWM1_PWM_OSC_OSCL2 Output Selection Clear for PWML output of the channel 2 **/
#define PWM1_PWM_OSC_OSCL2		(1 << 18)
/** PWM1_PWM_OSC_OSCL1 Output Selection Clear for PWML output of the channel 1 **/
#define PWM1_PWM_OSC_OSCL1		(1 << 17)
/** PWM1_PWM_OSC_OSCL0 Output Selection Clear for PWML output of the channel 0 **/
#define PWM1_PWM_OSC_OSCL0		(1 << 16)
/** PWM1_PWM_OSC_OSCH3 Output Selection Clear for PWMH output of the channel 3 **/
#define PWM1_PWM_OSC_OSCH3		(1 << 3)
/** PWM1_PWM_OSC_OSCH2 Output Selection Clear for PWMH output of the channel 2 **/
#define PWM1_PWM_OSC_OSCH2		(1 << 2)
/** PWM1_PWM_OSC_OSCH1 Output Selection Clear for PWMH output of the channel 1 **/
#define PWM1_PWM_OSC_OSCH1		(1 << 1)
/** PWM1_PWM_OSC_OSCH0 Output Selection Clear for PWMH output of the channel 0 **/
#define PWM1_PWM_OSC_OSCH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_ossupd PWMOSSUPD PWM Output Selection Set Update Register
@{*/

/** PWM1_PWM_OSSUPD_OSSUPL3 Output Selection Set for PWML output of the channel 3 **/
#define PWM1_PWM_OSSUPD_OSSUPL3		(1 << 19)
/** PWM1_PWM_OSSUPD_OSSUPL2 Output Selection Set for PWML output of the channel 2 **/
#define PWM1_PWM_OSSUPD_OSSUPL2		(1 << 18)
/** PWM1_PWM_OSSUPD_OSSUPL1 Output Selection Set for PWML output of the channel 1 **/
#define PWM1_PWM_OSSUPD_OSSUPL1		(1 << 17)
/** PWM1_PWM_OSSUPD_OSSUPL0 Output Selection Set for PWML output of the channel 0 **/
#define PWM1_PWM_OSSUPD_OSSUPL0		(1 << 16)
/** PWM1_PWM_OSSUPD_OSSUPH3 Output Selection Set for PWMH output of the channel 3 **/
#define PWM1_PWM_OSSUPD_OSSUPH3		(1 << 3)
/** PWM1_PWM_OSSUPD_OSSUPH2 Output Selection Set for PWMH output of the channel 2 **/
#define PWM1_PWM_OSSUPD_OSSUPH2		(1 << 2)
/** PWM1_PWM_OSSUPD_OSSUPH1 Output Selection Set for PWMH output of the channel 1 **/
#define PWM1_PWM_OSSUPD_OSSUPH1		(1 << 1)
/** PWM1_PWM_OSSUPD_OSSUPH0 Output Selection Set for PWMH output of the channel 0 **/
#define PWM1_PWM_OSSUPD_OSSUPH0		(1 << 0)

/**@}*/

/** @defgroup pwm1_pwm_oscupd PWMOSCUPD PWM Output Selection Clear Update Register
@{*/

