grevaillot/svd_tools/headers/ATSAMV71N21/pwm1.h
#define PWM1_PWM_VERSION_MFN_SHIFT		16
#define PWM1_PWM_VERSION_MFN_MASK		0x07
/** @defgroup pwm1_pwm_version_mfn MFN Metal Fix Number
@{*/
/**@}*/


#define PWM1_PWM_VERSION_VERSION_SHIFT		0
#define PWM1_PWM_VERSION_VERSION_MASK		0xfff
/** @defgroup pwm1_pwm_version_version VERSION Version of the Hardware Module
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_cmupd0 PWMCMUPD0 PWM Channel Mode Update Register (ch_num = 0)
@{*/

/** PWM1_PWM_CMUPD0_CPOLINVUP Channel Polarity Inversion Update **/
#define PWM1_PWM_CMUPD0_CPOLINVUP		(1 << 13)
/** PWM1_PWM_CMUPD0_CPOLUP Channel Polarity Update **/
#define PWM1_PWM_CMUPD0_CPOLUP		(1 << 9)

/**@}*/

/** @defgroup pwm1_pwm_cmupd1 PWMCMUPD1 PWM Channel Mode Update Register (ch_num = 1)
@{*/

/** PWM1_PWM_CMUPD1_CPOLINVUP Channel Polarity Inversion Update **/
#define PWM1_PWM_CMUPD1_CPOLINVUP		(1 << 13)
/** PWM1_PWM_CMUPD1_CPOLUP Channel Polarity Update **/
#define PWM1_PWM_CMUPD1_CPOLUP		(1 << 9)

/**@}*/

/** @defgroup pwm1_pwm_etrg1 PWMETRG1 PWM External Trigger Register (trg_num = 1)
@{*/

/** PWM1_PWM_ETRG1_RFEN Recoverable Fault Enable **/
#define PWM1_PWM_ETRG1_RFEN		(1 << 31)
/** PWM1_PWM_ETRG1_TRGSRC Trigger Source **/
#define PWM1_PWM_ETRG1_TRGSRC		(1 << 30)
/** PWM1_PWM_ETRG1_TRGFILT Filtered input **/
#define PWM1_PWM_ETRG1_TRGFILT		(1 << 29)
/** PWM1_PWM_ETRG1_TRGEDGE Edge Selection **/
#define PWM1_PWM_ETRG1_TRGEDGE		(1 << 28)

#define PWM1_PWM_ETRG1_TRGMODE_SHIFT		24
#define PWM1_PWM_ETRG1_TRGMODE_MASK		0x03
/** @defgroup pwm1_pwm_etrg1_trgmode TRGMODE External Trigger Mode
@{*/
/**@}*/


#define PWM1_PWM_ETRG1_MAXCNT_SHIFT		0
#define PWM1_PWM_ETRG1_MAXCNT_MASK		0xffffff
/** @defgroup pwm1_pwm_etrg1_maxcnt MAXCNT Maximum Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_lebr1 PWMLEBR1 PWM Leading-Edge Blanking Register (trg_num = 1)
@{*/

/** PWM1_PWM_LEBR1_PWMHREN PWMH Rising Edge Enable **/
#define PWM1_PWM_LEBR1_PWMHREN		(1 << 19)
/** PWM1_PWM_LEBR1_PWMHFEN PWMH Falling Edge Enable **/
#define PWM1_PWM_LEBR1_PWMHFEN		(1 << 18)
/** PWM1_PWM_LEBR1_PWMLREN PWML Rising Edge Enable **/
#define PWM1_PWM_LEBR1_PWMLREN		(1 << 17)
/** PWM1_PWM_LEBR1_PWMLFEN PWML Falling Edge Enable **/
#define PWM1_PWM_LEBR1_PWMLFEN		(1 << 16)

#define PWM1_PWM_LEBR1_LEBDELAY_SHIFT		0
#define PWM1_PWM_LEBR1_LEBDELAY_MASK		0x7f
/** @defgroup pwm1_pwm_lebr1_lebdelay LEBDELAY Leading-Edge Blanking Delay for TRGINx
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_cmupd2 PWMCMUPD2 PWM Channel Mode Update Register (ch_num = 2)
@{*/

/** PWM1_PWM_CMUPD2_CPOLINVUP Channel Polarity Inversion Update **/
#define PWM1_PWM_CMUPD2_CPOLINVUP		(1 << 13)
/** PWM1_PWM_CMUPD2_CPOLUP Channel Polarity Update **/
#define PWM1_PWM_CMUPD2_CPOLUP		(1 << 9)

/**@}*/

/** @defgroup pwm1_pwm_etrg2 PWMETRG2 PWM External Trigger Register (trg_num = 2)
@{*/

/** PWM1_PWM_ETRG2_RFEN Recoverable Fault Enable **/
#define PWM1_PWM_ETRG2_RFEN		(1 << 31)
/** PWM1_PWM_ETRG2_TRGSRC Trigger Source **/
#define PWM1_PWM_ETRG2_TRGSRC		(1 << 30)
/** PWM1_PWM_ETRG2_TRGFILT Filtered input **/
#define PWM1_PWM_ETRG2_TRGFILT		(1 << 29)
/** PWM1_PWM_ETRG2_TRGEDGE Edge Selection **/
#define PWM1_PWM_ETRG2_TRGEDGE		(1 << 28)

#define PWM1_PWM_ETRG2_TRGMODE_SHIFT		24
#define PWM1_PWM_ETRG2_TRGMODE_MASK		0x03
/** @defgroup pwm1_pwm_etrg2_trgmode TRGMODE External Trigger Mode
@{*/
/**@}*/


#define PWM1_PWM_ETRG2_MAXCNT_SHIFT		0
#define PWM1_PWM_ETRG2_MAXCNT_MASK		0xffffff
/** @defgroup pwm1_pwm_etrg2_maxcnt MAXCNT Maximum Counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_lebr2 PWMLEBR2 PWM Leading-Edge Blanking Register (trg_num = 2)
@{*/

/** PWM1_PWM_LEBR2_PWMHREN PWMH Rising Edge Enable **/
#define PWM1_PWM_LEBR2_PWMHREN		(1 << 19)
/** PWM1_PWM_LEBR2_PWMHFEN PWMH Falling Edge Enable **/
#define PWM1_PWM_LEBR2_PWMHFEN		(1 << 18)
/** PWM1_PWM_LEBR2_PWMLREN PWML Rising Edge Enable **/
#define PWM1_PWM_LEBR2_PWMLREN		(1 << 17)
/** PWM1_PWM_LEBR2_PWMLFEN PWML Falling Edge Enable **/
#define PWM1_PWM_LEBR2_PWMLFEN		(1 << 16)

#define PWM1_PWM_LEBR2_LEBDELAY_SHIFT		0
#define PWM1_PWM_LEBR2_LEBDELAY_MASK		0x7f
/** @defgroup pwm1_pwm_lebr2_lebdelay LEBDELAY Leading-Edge Blanking Delay for TRGINx
@{*/
/**@}*/


/**@}*/

/** @defgroup pwm1_pwm_cmupd3 PWMCMUPD3 PWM Channel Mode Update Register (ch_num = 3)
@{*/

/** PWM1_PWM_CMUPD3_CPOLINVUP Channel Polarity Inversion Update **/
#define PWM1_PWM_CMUPD3_CPOLINVUP		(1 << 13)
/** PWM1_PWM_CMUPD3_CPOLUP Channel Polarity Update **/
#define PWM1_PWM_CMUPD3_CPOLUP		(1 << 9)

/**@}*/
